package com.the703.basic006_ex;

public class ForIn001_1 {
	public static void main(String[] args) {
		//변수
		//입력
		/*		for(;;){
		 * 			국어점수 입력 > 100  
		 * 			if(잘썼으면,,,, 국어점수의 범위라면){ 나와! break;}
		 		} 
		 */
		
		/*		for(;;){
		 * 			영어점수 입력 > 100  
		 * 			if(잘썼으면,,,, 영어점수의 범위라면){ 나와! break;}
		 		} 
		 */
		
		/*		for(;;){
		 * 			수학점수 입력 > 100  
		 * 			if(잘썼으면,,,, 수학점수의 범위라면){ 나와! break;}
		 		} 
		 */
		//처리
		//출력
	}
}

/*
연습문제1)   
패키지명 : com.company.java004_ex
클래스명 :   ForIn001
출력내용 :  성적처리 프로그램입니다.

0. 국어,영어, 수학(0~100만입력받기)  무한반복
1. 총점 구하기
2. 평균 구하기
3. 평균이 60점이상이고  각과목이 40점 미만이면 아니라면 합격/ 아니면 불합격
4. 평균이 95점이상이면 장학생
5. 평균이  90점이상이면 수, 80점이상이면 우, 70점이상이면 미, 60점이상이면 양, 아니라면 가 

학번 입력 > std111
국어점수 입력 > 100    (0~100만입력받기)   for(;;){}
수학점수 입력 > 100    (0~100만입력받기)   for(;;){}
영어점수 입력 > 99     (0~100만입력받기)   for(;;){}
=================================================================================== 
학번   국어   영어   수학   총점   평균   합격여부   레벨   장학생
=================================================================================== 
std111   100   100   99   299   99.67   합격   수   장학생
*/