-- 1. CRUD (SELECT 집계함수)
-- 2. CRUD (SELECT 연습문제)
-- ________________________________________________________________
-- ________________________________________________________________


-- ■ 진행1. CRUD (SELECT 집계함수) 

-- >> 1.  [진행] 
-- DDL   : CREATE , ALTER, DROP
-- DML  : INSERT, SELECT#, UPDATE, DELETE
-- DCL   : GRANT, REVOKE 

--  
-- ===== 필기
-- SELECT   검색필드1, 검색필드2,,,
-- FROM    테이블명
-- WHERE where_condition ;
--   

-- SELECT   검색필드1, 검색필드2,,,
-- FROM    테이블명
-- WHERE where_condition  
-- ORDER BY   [ASC | DESC]
-- LIMIT offset;

-- SELECT  select_expr [, select_expr] ... 
--     [FROM table_references 
--     [WHERE where_condition]
--     [GROUP BY {col_name | expr | position}, ... [WITH ROLLUP]] #
--     [HAVING where_condition]  #
--     [ORDER BY {col_name | expr | position} 
--     [LIMIT {[offset,] row_count | row_count OFFSET offset}]
--  


-- >> 2.집합(GROUP BY)과 집계함수														
-- avg(컬럼명)  : 집합의 평균값												
-- max(컬럼명)  : 집합의 최댓값														
-- min(컬럼명)  : 집합의 최소값														
-- sum(컬럼명)  : 집합의 합게														
-- count(*)   : 집합의 집합의 요소수														
-- 	

-- >> 3.	[ SELECT  집계함수 FROM  [테이블이름]   GROUP BY [필드명]]														
-- SELECT score, count(*) FROM board GROUP BY kor;													
-- SELECT score, count(*) FROM board GROUP BY kor;													
-- 														
-- 														

-- >> 4.집계결과를 다시 필터링(HAVING문)  					
-- [ SELECT   집계함수  FROM  [테이블이름]   						
-- 	   GROUP BY [필드명]					
-- 	   HAVING   조건					
-- ]						
-- SELECT subject, count(*) FROM score 					
-- GROUP BY kor 				
-- HAVING  count(*) >= 5;			


--  
-- ------------------------------------------------------------
-- ------------------------------------------------------------  QUESTION
--  
-- [실습] 다음과 같이 데이터를 준비하시오
-- mysql> desc group_userinfo;
-- +-------+-------------+------+-----+---------+----------------+
-- | Field | Type        | Null | Key | Default | Extra          |
-- +-------+-------------+------+-----+---------+----------------+
-- | no    | int(11)     | NO   | PRI | NULL    | auto_increment |
-- | name  | varchar(20) | NO   |     | NULL    |                |
-- | age   | int(11)     | NO   |     | NULL    |                |
-- | sex   | char(2)     | YES  |     | NULL    |                |
-- | kor   | int(11)     | YES  |     | NULL    |                |
-- | eng   | int(11)     | YES  |     | NULL    |                |
-- | math  | int(11)     | YES  |     | NULL    |                |
-- | ban   | char(2)     | YES  |     | NULL    |                |
-- | sns   | char(2)     | YES  |     | y       |                |
-- +-------+-------------+------+-----+---------+----------------+
use mbasic;
create table group_userinfo(
 no     int(11)      not  NULL     auto_increment  primary  key,
 name   varchar(20)  not NULL                    ,
 age    int(11)      not NULL                    ,
 sex    char(2)      ,               
 kor    int(11)     ,          
 eng    int(11)      ,             
 math   int(11)     ,             
 ban    char(2)     ,              
 sns    char(2)     default    'y'                       
);
desc group_userinfo;


-- mysql> select * from group_userinfo;
-- +----+--------+-----+------+------+------+------+------+------+
-- | no | name   | age | sex  | kor  | eng  | math | ban  | sns  |
-- +----+--------+-----+------+------+------+------+------+------+
-- |  1 | first  |  11 | NULL |  100 |  100 |   99 | A    | n    |
-- |  2 | second |  22 | m    |   89 |   92 |   78 | B    | y    |
-- |  3 | third  |  33 | m    |   90 |   92 |   97 | A    | y    |
-- |  4 | fourth |  44 | f    |   40 |   42 |   67 | C    | n    |
-- |  5 | fifth  |  55 | f    |   89 |   86 |   99 | B    | y    |
-- |  6 | sixth  |  66 | m    |   10 |   20 |   44 | C    | n    |
-- +----+--------+-----+------+------+------+------+------+------+
-- 6 rows in set (0.00 sec)

insert into group_userinfo values (1  , 'first' ,    11,  NULL ,  100 ,  100,    99 , 'A', 'n');
insert into group_userinfo values (2  , 'second' ,   22,  'm'   ,  89 ,   92,    78,  'B' ,    'y');    
insert into group_userinfo values (3  , 'third' ,    33,  'm'  ,  90  ,  92,    97,  'A' ,    'y');    
insert into group_userinfo values (4  , 'fourth' ,   44,  'f'  ,  40 ,   42,    67,  'C' ,    'n');    
insert into group_userinfo values (5  , 'fifth' ,    55,  'f' ,   89 ,   86,    99 , 'B',     'y');    
insert into group_userinfo values (6  , 'sixth' ,    66,  'm' ,   10 ,   20,    44 , 'C'  ,'n');    





-- [question1] 나이평균 
-- mysql>   select  avg(age) from group_userinfo;
-- +----------+
-- | avg(age) |
-- +----------+
-- |  38.5000 |
-- +----------+
-- 1 row in set (0.00 sec)

select  avg(age)
from    group_userinfo;
-- where
-- order by
-- limit


-- [question2] 반별 몇명있는지 확인
-- +------+----------+
-- | ban  | count(*) |
-- +------+----------+
-- | A    |        2 |
-- | B    |        2 |
-- | C    |        2 |
-- +------+----------+
-- 3 rows in set (0.00 sec)

-- 10:42:11	select  ban,  count(*) from    group_userinfo LIMIT 0, 1000	Error Code: 1140. In aggregated query without GROUP BY, expression #1 of SELECT list contains nonaggregated column 'mbasic.group_userinfo.ban'; this is incompatible with sql_mode=only_full_group_by	0.000 sec
select  ban,  count(*)     -- 6 (집계안된 일반) , 1(집계)
from    group_userinfo;

select       ban,  count(*)    -- 반, 갯수
from         group_userinfo   
group by     ban;              -- 반별  ( 집계필드 빼고 다)
 

-- [question3] 반별 국영수의 총점 확인
-- +------+----------+----------+----------+
-- | ban  | 국어총합 | 영어총합 | 수학총합 |
-- +------+----------+----------+----------+
-- | A    |      190 |      192 |      196 |
-- | B    |      178 |      178 |      177 |
-- | C    |       50 |       62 |      111 |
-- +------+----------+----------+----------+
-- 3 rows in set (0.00 sec)
select    ban, sum(kor) `국어총합` , sum(eng)  `영어총합`, sum(math) `수학총합`
from      group_userinfo
group by  ban;

-- having



-- [question4] 반별 국영수의 평균 확인
-- +------+----------+----------+----------+
-- | ban  | 국어평균 | 영어평균 | 수학평균 |
-- +------+----------+----------+----------+
-- | A    |  95.0000 |  96.0000 |  98.0000 |
-- | B    |  89.0000 |  89.0000 |  88.5000 |
-- | C    |  25.0000 |  31.0000 |  55.5000 |
-- +------+----------+----------+----------+
-- 3 rows in set (0.00 sec)
select     ban  , avg(kor) `국어평균` , avg(eng) `영어평균` , avg(math) `수학평균` 
from       group_userinfo
group by   ban; 
 
-- [question5] 반별 나이의 총합과 나이 평균 확인
select    ban  , sum(age) `나이총합` , avg(age) `나이평균` , max(age) `최고나이` , min(age) `최저나이` 
from      group_userinfo
group by  ban;
-- +------+----------+----------+----------+----------+
-- | ban  | 나이총합 | 나이평균 | 최고나이 | 최저나이 |
-- +------+----------+----------+----------+----------+
-- | A    |       44 |  22.0000 |       33 |       11 |
-- | B    |       77 |  38.5000 |       55 |       22 |
-- | C    |      110 |  55.0000 |       66 |       44 |
-- +------+----------+----------+----------+----------+
-- 3 rows in set (0.00 sec)

--  

--  

-- [question6] 반별 국영수의 평균 확인후 '국어'평균점수가 89이상인 데이터만 고르기 
select      ban  , avg(kor) `국어평균` , avg(eng) `영어평균` , avg(math) `수학평균` 
from        group_userinfo
group by    ban
having      avg(kor) >= 89;

-- +------+----------+----------+----------+
-- | ban  | 국어평균 | 영어평균 | 수학평균 |
-- +------+----------+----------+----------+
-- | A    |  95.0000 |  96.0000 |  98.0000 |
-- | B    |  89.0000 |  89.0000 |  88.5000 |
-- +------+----------+----------+----------+
-- 2 rows in set (0.00 sec)

--  

-- [question7] 반별 나이의 총합과 나이 평균 확인후 그중에서 나이의 평균이 35세 이상인 데이터 추출
-- +------+----------+----------+----------+----------+
-- | ban  | 나이총합 | 나이평균 | 최고나이 | 최저나이 |
-- +------+----------+----------+----------+----------+
-- | B    |       77 |  38.5000 |       55 |       22 |
-- | C    |      110 |  55.0000 |       66 |       44 |
-- +------+----------+----------+----------+----------+
-- 2 rows in set (0.00 sec)
select      ban  ,  sum(age) `나이총합` ,  avg(age) `나이평균` , max(age) `최고나이` , min(age) `최저나이`
from        group_userinfo
group by    ban
having      avg(age) >= 35;  
   
   
-- [question8] 반별 나이의 총합과 나이 평균 확인후 그중에서 나이의 평균이 35세 이상인 데이터 추출후
--            평균나이의 내림차순으로 정렬하시오.        
select      ban  ,  sum(age) `나이총합` ,  avg(age) `나이평균` , max(age) `최고나이` , min(age) `최저나이`
from        group_userinfo
group by    ban
having      avg(age) >= 35
order by    avg(age) desc;  

-- +------+----------+----------+----------+----------+
-- | ban  | 나이총합 | 나이평균 | 최고나이 | 최저나이 |
-- +------+----------+----------+----------+----------+
-- | C    |      110 |  55.0000 |       66 |       44 |
-- | B    |       77 |  38.5000 |       55 |       22 |
-- +------+----------+----------+----------+----------+
-- 2 rows in set (0.00 sec)


-- -----------------------------------------------------------------------
-- -----------------------------------------------------------------------
-- [question9] 반별 미성년자의 숫자를 조회하시오.
-- +------+------------+
-- | ban  | 미성년자수 |
-- +------+------------+
-- | A    |          1 |
-- | B    |          0 |
-- | C    |          0 |
-- +------+------------+
-- 3 rows in set (0.00 sec)

--  

-- [question10] 반별 sns의 수신거부 숫자를 구하시오.
-- +------+---------------+
-- | ban  | sns수신거부수 |
-- +------+---------------+
-- | A    |             1 |
-- | B    |             0 |
-- | C    |             2 |
-- +------+---------------+

-- 3 rows in set (0.00 sec)



-- ________________________________________________________________
-- ________________________________________________________________



-- mysql> desc emp;
-- +----------+-------------+------+-----+---------+----------------+
-- | Field    | Type        | Null | Key | Default | Extra          |
-- +----------+-------------+------+-----+---------+----------------+
-- | empno    | int         | NO   | PRI | NULL    | auto_increment |
-- | ename    | varchar(20) | YES  |     | NULL    |                |
-- | job      | varchar(20) | YES  |     | NULL    |                |
-- | mgr      | int         | YES  |     | NULL    |                |
-- | hiredate | date        | YES  |     | NULL    |                |
-- | sal      | int         | YES  |     | NULL    |                |
-- | comm     | int         | YES  |     | NULL    |                |
-- | deptno   | int         | YES  |     | NULL    |                |
-- +----------+-------------+------+-----+---------+----------------+
-- 8 rows in set (0.00 sec)

-- mysql> select * from emp;
-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT  | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7902 | FORD   | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 14 rows in set (0.00 sec)
--  
--  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-1
-- -- emp 테이블에서  SUM함수를 사용하여 급여합계(sal)를  조회하시오. 
select   sum(sal) `급여합계`     from     emp; 
-- +----------+
-- | 급여합계 |
-- +----------+
-- |    29025 |
-- +----------+
-- 1 row in set (0.00 sec) 
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-2
-- -- emp 테이블에서  SUM함수를 사용하여 추가수당(COMM)합계를  조회하시오. 
select   sum(comm) `추가수당`  from emp;   -- null 빼고 집계
 
-- +----------+
-- | 추가수당 |
-- +----------+
-- |     2200 |
-- +----------+
-- 1 row in set (0.00 sec)

--        


-- --------------------------------------------------------
-- -------------------------------------------------------- 
-- -- 연습문제-3
-- -- emp 테이블에서  SUM함수를 사용하여 다음과 같이  조회하시오. 
select  sum(distinct sal) , sum(all sal) , sum(sal)   from    emp;
-- +-------------------+--------------+----------+
-- | sum(distinct sal) | sum(all sal) | sum(sal) |
-- +-------------------+--------------+----------+
-- |             24775 |        29025 |    29025 |
-- +-------------------+--------------+----------+
-- 1 row in set (0.00 sec)

-- mysql>

--  


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-4
-- -- emp 테이블의 레코드 갯수를  조회하시오.  -- 집계함수는 null  빼고 계산
select   count(*)  `전체레코드` , count(empno) `모든데이터` , count(mgr) `null빼고계산`  from emp;
select   count(*) from emp;

-- +------------+
-- | 데이터갯수 |
-- +------------+
-- |         14 |
-- +------------+
-- 1 row in set (0.00 sec)


--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-5
-- -- emp 테이블에서 부서번호가 30인 직원수를   조회하시오. 
select  count(*)   `부서30 직원수`   from emp   where  deptno=30;   -- 집계전 필터링

select  count(*)   `부서30 직원수`   from emp   group by deptno  having deptno=30;  -- 집계후 필터링

-- +---------------+
-- | 부서30 직원수 |
-- +---------------+
-- |             6 |
-- +---------------+
-- 1 row in set (0.00 sec)

-- mysql>



-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-6
-- -- emp 테이블에서  COUNT를 사용하여 다음과 같이  조회하시오.
select count(distinct sal) , count(all sal) , count(sal)   from emp;
-- +---------------------+----------------+------------+
-- | count(distinct sal) | count(all sal) | count(sal) |
-- +---------------------+----------------+------------+
-- |                  12 |             14 |         14 |
-- +---------------------+----------------+------------+
-- 1 row in set (0.00 sec)

-- mysql>



--  


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-7
-- -- emp 테이블에서  count를 이용하여 추가수당을 받는 (comm) 사원수를  조회하시오.
select   count(comm)  `추가수당을받는 사원수`  from emp;
-- +------------------------+
-- | 추가수당을받는 사원수       |
-- +------------------------+
-- |                      4 |
-- +------------------------+
-- 1 row in set (0.00 sec)  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-8
-- -- emp 테이블에서  IS NOT NULL을  이용하여 추가수당을 받는 (comm) 사원수를  조회하시오. 
-- -- 연습문제-8
select   count(comm)  `추가수당을받는 사원수`  from emp  where comm  is not null;
-- +------------------------+
-- | 추가수당을받는 사원수       |
-- +------------------------+
-- |                      4 |
-- +------------------------+
-- 1 row in set (0.00 sec) 

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-9
-- -- emp 테이블에서  부서번호가 10번인 사원들의 최대 급여를   조회하시오. 
select max(sal) `부서10 최대급여` from emp  where   deptno=10;                        -- 집계 전 필터링
select max(sal) `부서10 최대급여` from emp  group by deptno  having deptno=10;        -- 집계 후 필터링
-- +-----------------+
-- | 부서10 최대급여    |
-- +-----------------+
-- |            5000 |
-- +-----------------+
-- 1 row in set (0.00 sec) 
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-10
-- -- emp 테이블에서  부서번호가 10번인 사원들의 최소 급여를   조회하시오.
select min(sal) `부서10 최소급여` from emp  where   deptno=10;                        -- 집계 전 필터링
select min(sal) `부서10 최소급여` from emp  group by deptno  having deptno=10;        -- 집계 후 필터링
-- +-----------------+
-- | 부서10 최소급여 |
-- +-----------------+
-- |            1300 |
-- +-----------------+
-- 1 row in set (0.00 sec) 

--    


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-11
-- -- emp 테이블에서  부서번호가 20번인 사원들의 입사일 중 제일 최근의 입사일을   조회하시오. 
select   max(hiredate)  `부서20 최근입사일`
from emp
where  deptno=20;

-- +-------------------+
-- | 부서20 최근입사일 |
-- +-------------------+
-- | 1987-05-23        |
-- +-------------------+
-- 1 row in set (0.00 sec)

-- mysql>


--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-12
-- -- emp 테이블에서  부서번호가 20번인 사원들의 입사일 중 제일 오래된  입사일을   조회하시오. 
select   min(hiredate)  `부서20 제일오래 된 입사일`
from emp
where  deptno=20;

-- +---------------------------+
-- | 부서20 제일오래 된 입사일 |
-- +---------------------------+
-- | 1980-12-17                |
-- +---------------------------+
-- 1 row in set (0.00 sec)

--  


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-13
-- -- emp 테이블에서  부서번호가 30번인 사원들의 평균급여를  조회하시오. 
select  avg(sal)   `부서30 평균급여 `
from    emp
where   deptno=30;
-- +-----------------+
-- | 부서30 평균급여 |
-- +-----------------+
-- |       1566.6667 |
-- +-----------------+
-- 1 row in set (0.00 sec)


--  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-14
-- -- emp 테이블에서  부서번호가 30번인 사원들의  distinct를 이용하여 중복을 제거한 급여열의 평균급여를  조회하시오. 
-- +--------------------------+
-- | 부서30 중복제거 급여평균 |
-- +--------------------------+
-- |                1630.0000 |
-- +--------------------------+
-- 1 row in set (0.00 sec)
--  
select  avg(distinct sal)   `부서30 중복제거 평균급여 `
from    emp
where   deptno=30;

--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-15
-- -- emp 테이블에서 group by를 사용하여  부서별 평균급여를  조회하시오. 
-- +--------+-----------+
-- | deptno | 평균급여    |
-- +--------+-----------+
-- |     10 | 2916.6667 |
-- |     20 | 2175.0000 |
-- |     30 | 1566.6667 |
-- +--------+-----------+
-- 3 rows in set (0.00 sec)
select  deptno, avg(sal)
from    emp
group   by  deptno
order   by  deptno asc; 

--  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-16
-- -- emp 테이블에서  부서번호 및 직책별 평균급여로 정렬하여 다음과 같이 조회하시오. 
select     deptno , job  , avg(sal)   `평균급여`
from       emp
group by   deptno , job 
order by   deptno ;
-- +--------+-----------+-----------+
-- | deptno | job       | 평균급여  |
-- +--------+-----------+-----------+
-- |     10 | CLERK     | 1300.0000 |
-- |     10 | MANAGER   | 2450.0000 |
-- |     10 | PRESIDENT | 5000.0000 |
-- |     20 | ANALYST   | 3000.0000 |
-- |     20 | CLERK     |  950.0000 |
-- |     20 | MANAGER   | 2975.0000 |
-- |     30 | CLERK     |  950.0000 |
-- |     30 | MANAGER   | 2850.0000 |
-- |     30 | SALESMAN  | 1400.0000 |
-- +--------+-----------+-----------+
-- 9 rows in set (0.00 sec)



--  
--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-17
-- -- emp 테이블에서  각 부서의 직책별 평균급여를 구하되 그평균급여가 2000이상인 그룹만   조회하시오. 
select     deptno , job    , avg(sal) `평균급여` 
from       emp
group by   deptno , job 
having     avg(sal) >=2000 
order by   deptno ;

-- +--------+-----------+-----------+
-- | deptno | job       | 평균급여  |
-- +--------+-----------+-----------+
-- |     10 | MANAGER   | 2450.0000 |
-- |     10 | PRESIDENT | 5000.0000 |
-- |     20 | ANALYST   | 3000.0000 |
-- |     20 | MANAGER   | 2975.0000 |
-- |     30 | MANAGER   | 2850.0000 |
-- +--------+-----------+-----------+
-- 5 rows in set (0.00 sec)

--  
--  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-18
-- -- emp 테이블에서  각 부서의 직책별 평균급여를 구하되 그평균급여가 2000이상인 그룹만   조회하시오.
-- -- 다음코드를 작성해보고 오류가 난다면 오류가 나는 이유를 적으시오.
-- >>>> 집계함수의 조건은 having 절에서 처리

-- SELECT DEPTNO, JOB, AVG(SAL)
-- FROM EMP
-- WHERE AVG(SAL) >= 2000  
-- GROUP BY DEPTNO, JOB
-- ORDER BY DEPTNO, JOB;

--   


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 연습문제-19
-- -- emp 테이블에서  급여가 3000이하인 직원에서  
-- -- 각 부서의 직책별 평균급여가 2000이상인 그룹을 조회하시오. 
-- +--------+---------+-----------+
-- | deptno | job     | 평균급여  |
-- +--------+---------+-----------+
-- |     10 | MANAGER | 2450.0000 |
-- |     20 | ANALYST | 3000.0000 |
-- |     20 | MANAGER | 2975.0000 |
-- |     30 | MANAGER | 2850.0000 |
-- +--------+---------+-----------+
-- 4 rows in set (0.00 sec)
select    deptno , job   , avg(sal) `평균급여`
from      emp
where     sal <= 3000
group by  deptno , job 
having    avg(sal)>=2000
order by  deptno asc;



-- --------------------------------------------------------
-- -------------------------------------------------------- ##
-- -- 연습문제-20
-- -- emp 테이블에서 GROUP BY절만  사용하여  
-- -- 각부서의 직책별 사원수, 가장높은 급여, 급여합, 평균급여를  다음과 같이  사원데이터를  조회하시오. 
select  deptno , job    ,  count(*) `사원수`  , max(sal) `최고급여` , sum(sal) `급여합`, avg(sal) `평균급여`
from    emp
group by deptno , job   
order by deptno , job   ;


-- +--------+-----------+--------+----------+--------+-----------+
-- | deptno | job       | 사원수   | 최고급여   | 급여합   | 평균급여   |
-- +--------+-----------+--------+----------+--------+-----------+
-- |     10 | CLERK     |      1 |     1300 |   1300 | 1300.0000 |
-- |     10 | MANAGER   |      1 |     2450 |   2450 | 2450.0000 |
-- |     10 | PRESIDENT |      1 |     5000 |   5000 | 5000.0000 |
-- |     20 | ANALYST   |      2 |     3000 |   6000 | 3000.0000 |
-- |     20 | CLERK     |      2 |     1100 |   1900 |  950.0000 |
-- |     20 | MANAGER   |      1 |     2975 |   2975 | 2975.0000 |
-- |     30 | CLERK     |      1 |      950 |    950 |  950.0000 |
-- |     30 | MANAGER   |      1 |     2850 |   2850 | 2850.0000 |
-- |     30 | SALESMAN  |      4 |     1600 |   5600 | 1400.0000 |
-- +--------+-----------+--------+----------+--------+-----------+
-- 9 rows in set (0.00 sec)

-- mysql>

--  