-- SELECT   검색필드1, 검색필드2,,,
-- FROM    테이블명
-- WHERE where_condition
-- ORDER BY   [ASC | DESC]     
-- LIMIT offset;


-- ■ 1. 전체데이터 검색
-- select * from 테이블명
use mbasic;
select * from userinfo;


-- ■ 2. 필드검색
-- select  필드1, 필드2  from 테이블명;
select  no, name  from userinfo;
select  no, age   from userinfo;

-- ■ 3. 중복빼기 distinct
-- select   distinct 필드1 from 테이블명;

select * from userinfo;

insert into  userinfo (name, age) values ('first' ,11);
insert into  userinfo (name, age) values ('first' ,11);

select  name from userinfo;
select  distinct name from userinfo;  -- 중복빼기
-- select  no  , distinct name from userinfo;  -- error
select distinct no  ,  name from userinfo; 


-- ■ 4. 별명 as
-- select  필드1 `별명1`    , 필드2     `별명2`  from 테이블명;
-- select  필드1 as `별명1` , 필드2  as `별명2`  from 테이블명;

select   no    `번호` , name     `이름` , age      `나이`  from userinfo; 
select   no as `번호` , name  as `이름` , age  as  `나이`  from userinfo; 

select   no       , age*100/0.9            from userinfo;
select   no `번호` , age*100/0.9 `나이값계산` from userinfo;


-- ■ 5. 비교연산자
-- select  필드1, 필드2 ,,, from 테이블명  where 컬럼명 비교연산자 조건;
select * from userinfo   where name  = 'second';
select * from userinfo   where name != 'second';
select * from userinfo   where name <> 'second';   -- 권장사항
-- select * from userinfo   where name ^= 'second';  옛날버젼
select * from userinfo   where  age <  33;
select * from userinfo   where  age <= 33;
select * from userinfo   where  age >  33;
select * from userinfo   where  age >= 33;


--    where   비교연산자
--    컬럼 =   조건  : 같다
--    컬럼 <> 조건  : 다르다
--    컬럼 != 조건  : 다르다
--    컬럼 <  조건  : 작다
--    컬럼 <=  조건  : 작거나 같다
--    컬럼 >  조건    : 크다
--    컬럼 >=  조건  : 크거나 같다


-- ■ SQL  SELECT(6) 논리연산자
-- [ SELECT  [필드명] FROM  [테이블이름] WHERE 컬럼명 비교연산자 조건 (AND 또는 OR) 컬럼명 비교연산자 조건  ] 
select * from  userinfo  where age>=22  and  age <=33;


-- ■ SQL  SELECT(7) 범위로 추출(BETWEEN연산자)
-- [ SELECT  [필드명] FROM  [테이블이름] WHERE 컬럼명 BETWEEN 시작값 AND 끝값  ] 
select * from  userinfo  where age  between  22  and        33;   -- 22와 33포함?  o
select * from  userinfo  where          age>=22  and  age <=33;

-- ■ SQL  SELECT(8) 일치하는 레코드추출(IN연산자)
--  [ SELECT  [필드명] FROM  [테이블이름] WHERE 컬럼명 IN(값1, 값2, 값3,,,)  ] 
select * from userinfo  where  age  in ( 22, 44 );

-- ■ SQL  SELECT(9) 일치하는 레코드추출(OR연산자)
--  [ SELECT  [필드명] FROM  [테이블이름] WHERE 컬럼명=값1  or  컬럼명=값2  ] 
select  * from userinfo  where  age=22  or  age=44;

-- ■ SQL  SELECT(10) 추출조건으로 NULL지정
-- NULL과 같다는 것을 확인하고 싶을때 (=연산자 사용못함)
-- [ SELECT  [필드명] FROM  [테이블이름] WHERE 컬럼명 IS NULL]
-- SELECT * FROM select_userinfo   WHERE age is null ;
desc userinfo;
alter table userinfo  modify age  int null;  -- 빈칸허용( 공간은 있지만 데이터가 없어요 )
insert into userinfo  (name) values ('abc');
insert into userinfo  (name) values ('bbb');
select * from userinfo where  age  =  null;  -- 값 
select * from userinfo where  age  is null;  -- 상태
  
-- ■ SQL  SELECT(11) 문자열 필터링(LIKE문)
-- a%  (a로 시작하는 문자열) , %b (b로 끝나는) ,  %a% (a가 포함되는) , _a% (두번째 글자가 a인)
-- ename >= 'C' (첫문자 C와 같거나 뒤쪽인 사원)  C,D,E,F,,,,
select * from userinfo;
select * from userinfo where  name    =  'a%';   -- a로 시작하는 문자열  똑같은애들
select * from userinfo where  name  like 'a%';   -- a로 시작하는 문자열  (?)
select * from userinfo where  name  like '%b';   -- b로 끝나는 문자열
select * from userinfo where  name  like '%b%';  -- b가 포함된 문자열 
select * from userinfo where  name  like '_i%';  -- 두번째 문자가 i인 문자열 


-- ■ SQL  SELECT(12)  NOT (반대)
-- 컬럼명 NOT IN (값 ,값,...)
-- 컬럼명 NOT between 최소 AND 최대
-- 컬럼명 NOT LIKE '검색문자열'
--  
 
select * from userinfo  where  age >= 22  and  age<=33;  -- 22~33 살 사이
select * from userinfo  where  age between  22 and 33 ;  -- 22~33 살 사이

select * from userinfo  where  age not  between  22 and 33 ;  -- 22~33 살 사이가 아닌

select * from userinfo  where  age=22 or age=44;   -- 22이거나 44살 (or)
select * from userinfo  where  age in (22,44);     -- 22이거나 44살 (in)
select * from userinfo  where  age not in (22,44); -- 22살  아닌   , 44살 아닌 

select * from userinfo  where  name      like 'f%';   -- 이름이 f로 시작하는 
select * from userinfo  where  name  not like 'f%';   -- 이름이 f로 시작하지 않는
 
select * from userinfo  where   age  is null;         -- age값이 없는애들
select * from userinfo  where   age  is not null;     -- age값이 있는애들
select * from userinfo;


                  


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 1. 다음의 결과가나오게 조회하시오.
-- -- emp테이블의 모든열 출력하시오. 
select * from emp;

-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT  | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7902 | FORD   | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 14 rows in set (0.00 sec)



-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 2. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 부서번호가(deptno) 가 30인 데이터만 출력하시오.
select   *           -- 필드
from     emp         -- 테이블
where    deptno=30;  -- 부서번호가(deptno) 가 30인

-- +-------+--------+----------+------+------------+------+------+--------+
-- | empno | ename  | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+----------+------+------------+------+------+--------+
-- |  7499 | ALLEN  | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7654 | MARTIN | SALESMAN | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER  | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7844 | TURNER | SALESMAN | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7900 | JAMES  | CLERK    | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- +-------+--------+----------+------+------------+------+------+--------+
-- 6 rows in set (0.00 sec)

--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 3. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  부서번호가(deptno) 가 30이고 job이 SALESMAN 인 데이터를 조회하시오.
select   *
from     emp 
where    deptno=30  and  job='SALESMAN';

-- +-------+--------+----------+------+------------+------+------+--------+
-- | empno | ename  | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+----------+------+------------+------+------+--------+
-- |  7499 | ALLEN  | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7654 | MARTIN | SALESMAN | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7844 | TURNER | SALESMAN | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- +-------+--------+----------+------+------------+------+------+--------+
-- 4 rows in set (0.00 sec)

-- mysql>

--  



-- --------------------------------------------------------
-- --------------------------------------------------------  
-- -- 실습 4. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  부서번호가(deptno) 가 30이거나  job이 CLERK 인 데이터를 조회하시오.
select   *
from     emp
where    deptno=30  or  job= 'CLERK';

-- +-------+--------+----------+------+------------+------+------+--------+
-- | empno | ename  | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK    | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7654 | MARTIN | SALESMAN | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER  | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7844 | TURNER | SALESMAN | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK    | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK    | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK    | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+----------+------+------------+------+------+--------+
-- 9 rows in set (0.00 sec)

-- mysql> 

-- --------------------------------------------------------
-- --------------------------------------------------------  
-- -- 실습 5. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  급여*12한 값이 36000인 행을  조회하시오.
select   *
from     emp
where   sal * 12= 36000; 
-- +-------+-------+---------+------+------------+------+------+--------+
-- | empno | ename | job     | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+---------+------+------------+------+------+--------+
-- |  7788 | SCOTT | ANALYST | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7902 | FORD  | ANALYST | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+---------+------+------------+------+------+--------+
-- 2 rows in set (0.00 sec)
-- mysql>
--  


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 6. 다음의 결과가나오게 조회하시오.
-- --  emp테이블에서  대소비교연산자를 이용하여 급여가 3000이상인 사원정보를 조회하시오.
select   *
from     emp 
where    sal >= 3000;

-- +-------+-------+-----------+------+------------+------+------+--------+
-- | empno | ename | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- |  7788 | SCOTT | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING  | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7902 | FORD  | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- 3 rows in set (0.00 sec)
-- >>>>> 


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 7. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  대소비교연산자를 이용하여 사원의 첫문자가 F와 같거나 뒤쪽인  사원정보를 조회하시오.
select  *
from    emp
where   ename >= 'F';

-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7788 | SCOTT  | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7902 | FORD   | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 10 rows in set (0.00 sec)
-- >>>>>
--  
-- -- F 뒤쪽의 알파벳 F ,G, H ,,,,,Z
-- -- 알파벳순서로 뒤에 있는 알파벳문자들 가져오기

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 8. 다음의 결과가나오게 조회하시오. (비교문자열이 여러개일때)
-- -- emp테이블에서  대소비교연산자를 이용하여 사원의 이름이 (ENAME) FORD 문자열보다 알파벳순서로 앞에 있는   사원정보를 조회하시오.
-- --※ FORZ를 포함한 문자열보다 알파벳순서로 앞에 있는행을 출력하라는 의미 .  
-- -- 예) FIND (첫문자는 FORD 와같지만 두번째 I가 FORD의 O알파벳보다 순서상 빠르므로 조건식에 해당하는 값이 됨) 
select     *
from       emp
where      ename  <= 'FORD';   


-- +-------+-------+----------+------+------------+------+------+--------+
-- | empno | ename | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+----------+------+------------+------+------+--------+
-- |  7499 | ALLEN | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7698 | BLAKE | MANAGER  | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK | MANAGER  | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7876 | ADAMS | CLERK    | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7902 | FORD  | ANALYST  | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+----------+------+------------+------+------+--------+
-- 5 rows in set (0.00 sec)
--  
--  
--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 9. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  등가비교연산자(!=)를 이용하여 급여가 3000이 아닌사원의 데이터를 조회하시오.
SELECT  *
FROM    emp
WHERE   sal != 3000;

-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 12 rows in set (0.00 sec)    




-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 10. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  등가비교연산자(<>)를 이용하여 급여가 3000이 아닌사원의 데이터를 조회하시오.
SELECT  *
FROM    emp
WHERE   sal <> 3000;
-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 12 rows in set (0.01 sec)

-- mysql>     


--  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 11-. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  NOT연산자를 이용하여 급여가 3000이 아닌사원의 데이터를 조회하시오.
select   *  from     emp   where    not (sal=3000);
select   *  from     emp   where    sal   not  in (3000);

-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 12 rows in set (0.00 sec)
--       
--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 12. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  OR연산자를 이용하여 JOB이MANAGER 이거나 SALESMAN 또는 CLERK 인   데이터를 조회하시오.
select    *
from      emp
where     job='MANAGER'  or  job='SALESMAN'  or job='CLERK';

-- +-------+--------+----------+------+------------+------+------+--------+
-- | empno | ename  | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK    | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER  | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER  | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER  | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK    | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK    | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK    | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+----------+------+------------+------+------+--------+
-- 11 rows in set (0.00 sec)
-- >>>>>> 


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 13. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  IN연산자를 이용하여 JOB이MANAGER 이거나 SALESMAN 또는 CLERK 인   데이터를 조회하시오.
select    *
from      emp
where     job   in  ('MANAGER' , 'SALESMAN' ,'CLERK');


-- +-------+--------+----------+------+------------+------+------+--------+
-- | empno | ename  | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK    | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER  | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER  | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER  | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK    | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK    | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK    | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+----------+------+------------+------+------+--------+
-- 11 rows in set (0.00 sec)

-- >>>> 

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 14. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서   AND연산자와 등가비교연산자( !=  , <>  )를 이용하여 
-- -- JOB이 MANAGER 이거나 SALESMAN 또는 CLERK 이 아닌 데이터를 조회하시오.
-- -- 등가비교연산자( !=  , <> ) 를 모두 이용하시오 
select    *
from      emp
where     job!='MANAGER' and job!='SALESMAN' and job<>'CLERK';
-- +-------+-------+-----------+------+------------+------+------+--------+
-- | empno | ename | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- |  7788 | SCOTT | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING  | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7902 | FORD  | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- 3 rows in set (0.00 sec)
--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 15. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 NOT연산자와 IN연산자를 이용하여 
-- -- JOB이 MANAGER 이거나 SALESMAN 또는 CLERK 가 아닌 데이터를 조회하시오.
-- +-------+-------+-----------+------+------------+------+------+--------+
-- | empno | ename | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- |  7788 | SCOTT | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING  | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7902 | FORD  | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+-----------+------+------------+------+------+--------+
-- 3 rows in set (0.00 sec)
select    *
from      emp
where     job  not in ('MANAGER', 'SALESMAN' ,'CLERK');
--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 16. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 대소비교연산자(>= , <=)와 AND연산자를 사용하여 급여가 2000~3000인 사원데이터를  조회하시오.
select *
from   emp
where  sal >= 2000 and  sal<=3000;
-- +-------+-------+---------+------+------------+------+------+--------+
-- | empno | ename | job     | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+---------+------+------------+------+------+--------+
-- |  7566 | JONES | MANAGER | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7698 | BLAKE | MANAGER | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK | MANAGER | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT | ANALYST | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7902 | FORD  | ANALYST | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+---------+------+------------+------+------+--------+
-- 5 rows in set (0.00 sec)
--  


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 17. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 BETWEEN와 AND연산자를 사용하여 급여가 2000~3000인 사원데이터를  조회하시오.
select     *
from       emp
where      sal   between   2000 and 3000;     -- sal >= 2000  and  sal <= 3000

-- +-------+-------+---------+------+------------+------+------+--------+
-- | empno | ename | job     | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+---------+------+------------+------+------+--------+
-- |  7566 | JONES | MANAGER | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7698 | BLAKE | MANAGER | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK | MANAGER | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT | ANALYST | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7902 | FORD  | ANALYST | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+---------+------+------------+------+------+--------+
-- 5 rows in set (0.00 sec) 
-- >>>>>> 


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 18. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 NOT BETWEEN와 AND연산자를 사용하여 급여가 2000~3000사이 이외의 사원데이터를  조회하시오.
select     *
from       emp
where      sal  not between     2000  and 3000;

-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 9 rows in set (0.00 sec)

-- mysql>
-- >>>> 

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 19 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 NOT와 AND연산자를 사용하여 급여가 2000~3000사이 이외의 사원데이터를  조회하시오. 
select   *
from     emp
where    not   (  sal >= 2000   and  sal<= 3000);


-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 9 rows in set (0.00 sec)
-- >>>> 


-- --------------------------------------------------------
-- --------------------------------------------------------ㅁ
-- -- 실습 20 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  사원번호( empno) 가 7499이고 부서번호가 30인  데이터를 조회하시오. 
select    *
from      emp
where     empno = 7499   and   deptno=30;

-- +-------+-------+----------+------+------------+------+------+--------+
-- | empno | ename | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+----------+------+------------+------+------+--------+
-- |  7499 | ALLEN | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- +-------+-------+----------+------+------------+------+------+--------+
-- 1 row in set (0.00 sec)

 

-- --------------------------------------------------------
-- --------------------------------------------------------ㅁ
-- -- 실습 21. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  부서번호가(deptno) 가 20이거나  job이 SALESMAN 인 데이터를 조회하시오. 
select   *
from     emp
where    deptno=20  or  job='SALESMAN';

-- +-------+--------+----------+------+------------+------+------+--------+
-- | empno | ename  | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK    | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER  | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7788 | SCOTT  | ANALYST  | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7844 | TURNER | SALESMAN | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK    | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7902 | FORD   | ANALYST  | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+--------+----------+------+------------+------+------+--------+
-- 9 rows in set (0.00 sec)
--  


-- --------------------------------------------------------
-- --------------------------------------------------------  
-- -- 실습 22. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  대소비교연산자를 이용하여 급여가 2500이상이고 직업이 ANALYST인 사원정보를 조회하시오. 
select   *
from     emp
where    sal >= 2500  and  job='ANALYST';

-- +-------+-------+---------+------+------------+------+------+--------+
-- | empno | ename | job     | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+---------+------+------------+------+------+--------+
-- |  7788 | SCOTT | ANALYST | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7902 | FORD  | ANALYST | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- +-------+-------+---------+------+------------+------+------+--------+
-- 2 rows in set (0.00 sec)

-- >>>>> 

-- --------------------------------------------------------
-- --------------------------------------------------------  
-- -- 실습 23. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 부서번호(DEPTNO)가 10, 20번인 사원정보를 조회하시오. 
select   *
from     emp
where    deptno =10  or  deptno=20;

select   *
from     emp
where    deptno   in  (10,20) ;

-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT  | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7902 | FORD   | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 8 rows in set (0.00 sec)

--  

-- --------------------------------------------------------
-- --------------------------------------------------------  
-- -- 실습 24. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  in을 이용하여  부서번호(DEPTNO)가 10, 20번이 아닌 사원정보를 조회하시오. 
select   *
from     emp
where    deptno not  in  (10,20) ;

-- +-------+--------+----------+------+------------+------+------+--------+
-- | empno | ename  | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+----------+------+------------+------+------+--------+
-- |  7499 | ALLEN  | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7654 | MARTIN | SALESMAN | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER  | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7844 | TURNER | SALESMAN | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7900 | JAMES  | CLERK    | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- +-------+--------+----------+------+------------+------+------+--------+
-- 6 rows in set (0.00 sec)

--  





-- --------------------------------------------------------
-- --------------------------------------------------------  
-- -- 실습 25. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 LIKE연산자를 사용하여  이름이 S로 시작하는 사원데이터를  조회하시오. 
select   *
from     emp
where    ename   like  's%';


-- +-------+-------+---------+------+------------+------+------+--------+
-- | empno | ename | job     | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+---------+------+------------+------+------+--------+
-- |  7369 | SMITH | CLERK   | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7788 | SCOTT | ANALYST | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- +-------+-------+---------+------+------------+------+------+--------+
-- 2 rows in set (0.30 sec)


-- >>>>>
--  
--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 26. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 LIKE연산자를 사용하여  이름의 두번째 글자가 L인  사원데이터를  조회하시오. 
select *
from   emp
where  ename  like '_L%';

-- +-------+-------+----------+------+------------+------+------+--------+
-- | empno | ename | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+----------+------+------------+------+------+--------+
-- |  7499 | ALLEN | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7698 | BLAKE | MANAGER  | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK | MANAGER  | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- +-------+-------+----------+------+------------+------+------+--------+
-- 3 rows in set (0.00 sec)
--   
-- >>>>>
--  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 27. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 LIKE연산자를 사용하여  이름에 AM이 포함되어 있는  사원데이터를  조회하시오. 
select   *
from     emp
where    ename  like   '%AM%';

-- +-------+-------+-------+------+------------+------+------+--------+
-- | empno | ename | job   | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+-------+------+------------+------+------+--------+
-- |  7876 | ADAMS | CLERK | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES | CLERK | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- +-------+-------+-------+------+------------+------+------+--------+
 

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 28. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 LIKE연산자를 사용하여  이름에 AM이 포함되어 있지 않은 사원데이터를  조회하시오. 
select   *
from     emp
where    ename NOT like   '%AM%';

-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT  | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7902 | FORD   | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 12 rows in set (0.00 sec)
-- >>>>>
--  

--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 29. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서
-- -- 이름에 AM이 포함되어 있는  사원데이터의 
-- -- 별칭을 사용하여  사원이름(ENAME) , 급여(SAL) , 연봉(급여*12 + 커미션) , 커미션(COMM) 사원데이터를  조회하시오.
select   ENAME , SAL  ,  SAL*12 + COMM        AS  `ANNSAL` , COMM
from     emp
where    ename   like   '%AM%';

-- +-------+------+--------+------+
-- | ENAME | SAL  | ANNSAL | COMM |
-- +-------+------+--------+------+
-- | ADAMS | 1100 |   NULL | NULL |
-- | JAMES |  950 |   NULL | NULL |
-- +-------+------+--------+------+
-- 2 rows in set (0.00 sec) 

--  



-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 30. 다음의 실행해보시오.
-- -- emp테이블에서 등가비교연산자(=)와 NULL을  사용하여  커미션이 NULL인  사원데이터를  조회하시오.
-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
SELECT   *
FROM     EMP
WHERE    COMM = NULL;   --   = 상태 X

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 31. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 IS NULL을  사용하여  커미션이 NULL인  사원데이터를  조회하시오.
-- -- ※ 상태를 나타내는 IS NULL을 이용해야함. 
SELECT   *
FROM     EMP
WHERE    COMM IS NULL;      

-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7566 | JONES  | MANAGER   | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7698 | BLAKE  | MANAGER   | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER   | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT  | ANALYST   | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7902 | FORD   | ANALYST   | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 10 rows in set (0.00 sec)


-- >>>>    

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 32. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 IS NOT NULL을  사용하여  직속상관(MGR)이 있는 사원데이터를  조회하시오.
-- -- ※ㅁ 상태를 나타내는 IS NULL을 이용해야함. 
SELECT  *
FROM    emp  
WHERE   MGR is not null;  

-- +-------+--------+----------+------+------------+------+------+--------+
-- | empno | ename  | job      | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK    | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7566 | JONES  | MANAGER  | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7654 | MARTIN | SALESMAN | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7698 | BLAKE  | MANAGER  | 7839 | 1981-05-01 | 2850 | NULL |     30 |
-- |  7782 | CLARK  | MANAGER  | 7839 | 1981-06-09 | 2450 | NULL |     10 |
-- |  7788 | SCOTT  | ANALYST  | 7566 | 1987-04-19 | 3000 | NULL |     20 |
-- |  7844 | TURNER | SALESMAN | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK    | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK    | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7902 | FORD   | ANALYST  | 7566 | 1981-12-03 | 3000 | NULL |     20 |
-- |  7934 | MILLER | CLERK    | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+----------+------+------------+------+------+--------+
-- 13 rows in set (0.00 sec)

-- >>>> 
--  

-- --------------------------------------------------------
-- -------------------------------------------------------- 
-- -- 실습 33. 다음을 실행해보시오.
-- -- 1. 의미하는 바는?
-- -- ※ 어떤값인지 모르는 값에   = ,> 등가비교연산자를 사용할수 없음!
-- -- 선택된 행 없음
SELECT *
FROM emp
WHERE SAL > NULL;
  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 34. 다음을 실행해보시오.
-- -- 1. 의미하는바는?   null  or   true   => true
SELECT *
FROM   emp
WHERE SAL > NULL  
OR    COMM IS NULL;    
  
-- --------------------------------------------------------
-- --------------------------------------------------------  
-- -- 실습 35. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  사원이름이(ename) S로 끝나는 사원데이터를 모두   조회하시오. 
select  *
from    emp
where   ename like '%s';

-- +-------+-------+---------+------+------------+------+------+--------+
-- | empno | ename | job     | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+-------+---------+------+------------+------+------+--------+
-- |  7566 | JONES | MANAGER | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7876 | ADAMS | CLERK   | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES | CLERK   | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- +-------+-------+---------+------+------------+------+------+--------+
-- 3 rows in set (0.00 sec)

--  
--  
-- --------------------------------------------------------
-- --------------------------------------------------------  
-- -- 실습 36. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  부서번호가(deptno) 가 30이고 job이 SALESMAN 인 데이터를 조회하시오.
select  empno , ENAME  , JOB     , SAL , DEPTNO 
from    emp
where   deptno=30  and  job='SALESMAN';

-- +-------+--------+----------+------+--------+
-- | empno | ENAME  | JOB      | SAL  | DEPTNO |
-- +-------+--------+----------+------+--------+
-- |  7499 | ALLEN  | SALESMAN | 1600 |     30 |
-- |  7521 | WARD   | SALESMAN | 1250 |     30 |
-- |  7654 | MARTIN | SALESMAN | 1250 |     30 |
-- |  7844 | TURNER | SALESMAN | 1500 |     30 |
-- +-------+--------+----------+------+--------+
-- 4 rows in set (0.01 sec)

--  
-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 37. 집합연산자를 사용하지 않은 방식을 이용하여 다음의 결과가나오게 조회하시오. 
-- -- emp테이블에서  부서번호가 20,30 인 사원중 급여가 2000 초과인 사원데이터를  조회하시오.
-- -- 집합연산자를 사용하지 마시오
select  empno , ENAME  , JOB     , SAL , DEPTNO 
from    emp
where   sal > 2000  and   deptno  in (20,30);
-- +-------+-------+---------+------+--------+
-- | empno | ENAME | JOB     | SAL  | DEPTNO |
-- +-------+-------+---------+------+--------+
-- |  7566 | JONES | MANAGER | 2975 |     20 |
-- |  7698 | BLAKE | MANAGER | 2850 |     30 |
-- |  7788 | SCOTT | ANALYST | 3000 |     20 |
-- |  7902 | FORD  | ANALYST | 3000 |     20 |
-- +-------+-------+---------+------+--------+
-- 4 rows in set (0.02 sec) 

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 38. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  NOT BETWEEN 를 사용하지 않고 급여(sal)가 2000이상 3000이하 이외의 값을 가진 데이터를  조회하시오.
select  *
from    emp
where   sal < 2000  or  sal>3000;   -- O

select  *
from    emp
where   sal  not between  2000 and 3000;  -- ※ 참고) not between 이용하는 방법
 
-- +-------+--------+-----------+------+------------+------+------+--------+
-- | empno | ename  | job       | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK     | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7499 | ALLEN  | SALESMAN  | 7698 | 1981-02-20 | 1600 |  300 |     30 |
-- |  7521 | WARD   | SALESMAN  | 7698 | 1981-02-22 | 1250 |  500 |     30 |
-- |  7654 | MARTIN | SALESMAN  | 7698 | 1981-09-28 | 1250 | 1400 |     30 |
-- |  7839 | KING   | PRESIDENT | NULL | 1981-11-17 | 5000 | NULL |     10 |
-- |  7844 | TURNER | SALESMAN  | 7698 | 1981-09-08 | 1500 |    0 |     30 |
-- |  7876 | ADAMS  | CLERK     | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK     | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK     | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+-----------+------+------------+------+------+--------+
-- 9 rows in set (0.00 sec)
--  

-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 39. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서 부서번호가 30이고 이름에 E가 포함되어 있는 사원중 
-- -- 급여(sal)가 1000~2000 사이가 아닌 값을 가진 데이터를  조회하시오.
select  ENAME , empno , SAL  , DEPTNO
from    emp   
where   deptno=30   and  ename  like '%E%'  
        and  sal  not between  1000 and 2000; 
-- +-------+-------+------+--------+
-- | ENAME | empno | SAL  | DEPTNO |
-- +-------+-------+------+--------+
-- | BLAKE |  7698 | 2850 |     30 |
-- | JAMES |  7900 |  950 |     30 |
-- +-------+-------+------+--------+
-- 2 rows in set (0.00 sec)

--  


-- --------------------------------------------------------
-- --------------------------------------------------------
-- -- 실습 40. 다음의 결과가나오게 조회하시오.
-- -- emp테이블에서  
-- -- 추가수당(comm) 이 없고 
-- -- 상급자(mgr)은 존재하며
-- -- 직책(JOB) 'MANAGER', 'CLERK' 중에서 
-- -- 사원이름의 두번째 글자가 L이아닌
-- -- 사원데이터를  조회하시오
--  

-- +-------+--------+---------+------+------------+------+------+--------+
-- | empno | ename  | job     | mgr  | hiredate   | sal  | comm | deptno |
-- +-------+--------+---------+------+------------+------+------+--------+
-- |  7369 | SMITH  | CLERK   | 7902 | 1980-12-17 |  800 | NULL |     20 |
-- |  7566 | JONES  | MANAGER | 7839 | 1981-04-02 | 2975 | NULL |     20 |
-- |  7876 | ADAMS  | CLERK   | 7788 | 1987-05-23 | 1100 | NULL |     20 |
-- |  7900 | JAMES  | CLERK   | 7698 | 1981-12-03 |  950 | NULL |     30 |
-- |  7934 | MILLER | CLERK   | 7782 | 1982-01-23 | 1300 | NULL |     10 |
-- +-------+--------+---------+------+------------+------+------+--------+
-- 5 rows in set (0.00 sec)

--  

